tap "dojofive/dojofive"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "keith/formulae"
tap "osx-cross/avr"
tap "yannick-cw/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Arduino command-line interface
brew "arduino-cli"
# Message bus system, providing inter-application communication
brew "dbus"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Collection of portable C++ source libraries
brew "boost"
# Library for USB device access
brew "libusb"
# Atmel AVR MCU programmer
brew "avrdude"
# Generate compilation database for clang tooling
brew "bear"
# GNU binary tools for native development
brew "binutils"
# Size profiler for binaries
brew "bloaty"
# Freely available high-quality data compressor
brew "bzip2"
# Vector graphics library with cross-device output support
brew "cairo"
# Object-file caching compiler wrapper
brew "ccache"
# Turn English phrases to C or C++ declarations
brew "cdecl"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Distributed, open source, package manager for C/C++
brew "conan"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# USB programmer
brew "dfu-util"
# Diff that understands syntax
brew "difftastic"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Generate documentation for several programming languages
brew "doxygen"
# Device tree compiler
brew "dtc"
# Program that can automate interactive applications
brew "expect"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Official GitLab CI runner
brew "gitlab-runner"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Perfect hash function generator
brew "gperf"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Command-line benchmarking tool
brew "hyperfine"
# Tool to analyze #includes in C and C++ source files
brew "include-what-you-use"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Pager program similar to more
brew "less"
# General purpose TCP-IP emulator
brew "libslirp"
# Next-gen compiler infrastructure
brew "llvm@16", link: true
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Mac App Store command-line interface
brew "mas"
# Syntax-aware git merge driver
brew "mergiraf"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Parses Message Sequence Chart descriptions and produces images
brew "mscgen"
# C library for encoding and decoding Protocol Buffer messages
brew "nanopb"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Development kit for the Java programming language
brew "openjdk"
# Minimal dumb-terminal emulation program
brew "picocom"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Tool for managing OCI containers and pods
brew "podman"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Repository tool for Android development
brew "repo"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Display and control your Android device
brew "scrcpy"
# Shell Script Compiler
brew "shc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOcket CAT: netcat on steroids
brew "socat"
# Tools for manipulating EPROM load files
brew "srecord"
# STM32 discovery line Linux programmer
brew "stlink"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# MUD client
brew "tintin"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Source code beautifier
brew "uncrustify"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript - v16.0.6
brew "dojofive/dojofive/clang-format@16.0.6"
# Static analysis of C and C++ code
brew "dojofive/dojofive/cppcheck@2.7.1"
# Protocol buffers (Google's data interchange format)
brew "dojofive/dojofive/protobuf@3.19"
# Extract libraries from the dyld shared cache
brew "keith/formulae/dyld-shared-cache-extractor"
# Adding ocr to images in notion
brew "yannick-cw/tap/notion-ocr"
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Build desktop apps with JavaScript, HTML, and CSS
cask "electron"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Screen and video recording software
cask "loom"
# Static source code analysis tool
cask "oclint"
# Programmable solid 3D CAD modeller
cask "openscad"
# Open source virtual/remote desktop application
cask "rustdesk"
# Software and Documentation pack for Segger J-Link debug probes
cask "segger-jlink"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
cask "visual-studio-code"
mas "Boop", id: 1518425043
mas "CompareMerge2", id: 1459748650
mas "DirEqual", id: 1435575700
mas "Discovery", id: 1381004916
mas "Final Video Player", id: 1335335588
mas "Harvest", id: 506189836
mas "InYourFace", id: 1476964367
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Log-Viewer", id: 1543753042
mas "Messenger", id: 1480068668
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Remote Desktop", id: 1295203466
mas "PL2303Serial", id: 1624835354
mas "QuickFTP", id: 1451646819
mas "Ring", id: 1142753258
mas "Slack", id: 803453959
mas "Steam Link", id: 1246969117
mas "Tailscale", id: 1475387142
mas "Unzip One", id: 1127253508
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "ajshort.include-autocomplete"
vscode "akiramiyakoda.cppincludeguard"
vscode "alefragnani.project-manager"
vscode "ameenahsanma.poetry-monorepo"
vscode "astallinger.sourcetrail"
vscode "augustocdias.tasks-shell-input"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dan-c-underwood.arm"
vscode "davidanson.vscode-markdownlint"
vscode "davidschuldenfrei.gtest-adapter"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hars.cppsnippets"
vscode "hbenl.vscode-test-explorer"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "numaru.vscode-ceedling-test-adapter"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "pokey.parse-tree"
vscode "pokey.semantic-movement"
vscode "pokey.talon"
vscode "pokowaka.pokowaka-iwyu"
vscode "qcz.text-power-tools"
vscode "qezhu.gitlink"
vscode "redhat.vscode-yaml"
vscode "rioj7.command-variable"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "sohamkamani.code-eol"
vscode "swellaby.rust-pack"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tomoki1207.pdf"
vscode "tostc.vscl"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "webfreak.debug"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zixuanwang.linkerscript"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
